#https://stepik.org/lesson/334152/step/7?unit=317561
# объявление функции
def number_to_words(num):
    list_1 = ['один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять', 'десять']
    list_11 = ['одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать']
    list_21 = ['двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
    if num >= 1 and num <=10:
        return list_1[num-1]
    elif num >= 11 and num <=19:
        return list_11[num-11]
    else:
        if num%10 == 0:
            result = list_21[(num//10)-2]
            return result
        else:
            result = list_21[(num//10)-2] + ' ' + list_1[(num%10)-1]
            return result
# считываем данные
n = int(input())

# вызываем функцию
print(number_to_words(n))